Tekla Open API Reference for Tekla Structures 2025
ViewCamera Constructor
Instantiates a new view camera instance with zero length vectors.
 Namespace: Tekla.Structures.Model.UI
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public ViewCamera()
Public Sub New
See Also
Reference
ViewCamera Class
Tekla.Structures.Model.UI Namespace